<template>
  <div class="container-md d-none d-md-block">
    <ul>
      <NewsApp
          v-for="n in news"
          v-bind:n="n"
          v-bind:like="like"
          v-bind:dislike="dislike"
          v-bind:like_count="like_count"
          v-bind:dislike_count="dislike_count"
          v-on:like_func="like_func"
          v-on:dislike_func="dislike_func">
      </NewsApp>
    </ul>
  </div>
  <div class="wrapper-sm d-md-none">
    <ul>
      <NewsApp
          v-for="n in news"
          v-bind:n="n"
          v-bind:like="like"
          v-bind:like_count="like_count"
          v-bind:dislike_count="dislike_count"
          v-bind:dislike="dislike"
          v-on:like_func="like_func"
          v-on:dislike_func="dislike_func">
      </NewsApp>
    </ul>
  </div>
</template>


<script>
import NewsApp from "@/components/NewsApp";
import {mapActions } from 'vuex'
export default {
  name: "HomeApp",
  data(){
    return{
      search: '',
      news:[
        {'id': 1, 'title': 'Cristiano Ronaldo', 'author': 'Arseniy Bogachev','data': '05.11.21', 'text': "Вторая подряд победа в Серии А и новые рекорды (2019—2021)\n" +
              "23 сентября 2019 года Криштиану Роналду занял третье место в номинации на награду The Best FIFA Men’s Player[207]. 18 декабря португалец в борьбе за верховой мяч прыгнул на 256 см (выше перекладины футбольных ворот), в этом эпизоде он забил победный мяч в ворота «Сампдории»[208]. 6 января 2020 года Роналду сделал свой первый хет-трик в Серии А, благодаря чему «старая синьора» смогла одержать победу над «Кальяри» (4:0). 22 февраля в матче против СПАЛ Роналду забил гол в своей 11-й игре подряд в Серии А, повторив рекорд лиги, установленный Габриэлем Батистутой и Фабио Квальяреллой[209]. Также этот матч стал 1000-м для португальца в профессиональном футболе[209]. 17 июня 2020 года Криштиану Роналду сыграл в финале Кубка Италии против «Наполи», в котором «Ювентус» потерпел поражение по итогу серии пенальти[210]. 22 июня Роналду реализовал пенальти в матче против «Болоньи» и обогнал Руя Кошту, став самым результативным португальским игроком в истории чемпионата Италии[211]. 4 июля он забил свой 25-й гол в сезоне, реализовав штрафной удар в матче против «Торино». Роналду стал первым игроком «Ювентуса», достигшим данного результата после Омара Сивори, данный гол также стал первым для Криштиану со штрафного удара за 43 попытки в составе «бьянконери»[212]. 20 июля Роналду забил два гола в матче против «Лацио»; один из его мячей стал 50-м в Серии А. Криштиану Роналду забил 50 голов за 61 матч чемпионата Италии, из-за чего стал самым быстрым игроком, который достиг данного результата, а также первым игроком в истории, забившим 50 голов в чемпионатах Англии, Испании и Италии[213]. По итогам сезона Роналду вновь стал чемпионом Италии. Лигу чемпионов «Ювентус» покинул на стадии 1/4 финала, проиграв «Лиону» по правилу выездного гола. Роналду сделал дубль в ответном матче, но по сумме двух игр счёт был 2:2, что давало право пройти дальше французам[214].\n" +
              "\n" +
              "20 сентября 2020 года Роналду отличился забитым мячом уже в первом матче чемпионата против «Сампдории», чем помог своей команде победить со счётом 3:0[215]. В октябре португалец заразился инфекцией COVID-19, в связи с чем ему пришлось провести три недели в самоизоляции[216]. 1 ноября Роналду вновь появился на поле в матче против «Специи», он вышел со скамейки запасных во втором тайме и забил гол в течение первых трёх минут. Спустя некоторое время Роналду забил свой второй мяч с пенальти, чем помог своей команде одержать победу (4:1)[216]. 2 декабря Криштиану забил гол в ворота киевского «Динамо» в матче группового этапа Лиги чемпионов, который стал 750-м голом португальца в профессиональной карьере[217]. 13 декабря португалец сыграл свой 100-й матч в составе «Ювентуса» во всех соревнованиях, в этом матче он забил два гола, причём оба — с пенальти, чем помог своему клубу обыграть «Дженоа»[218]. Впоследствии Роналду занял второе место в номинации на награду The Best FIFA Men’s Player, уступив Роберту Левандовскому[219].\n" +
              "\n" +
              "22 августа 2021 года Роналду начал первую игру нового сезона на скамейке запасных, заменив испанца Альваро Морату в матче против «Удинезе» (2:2)[220]. Хотя тренер Массимилиано Аллегри подтвердил, что это было его решение из-за физической формы португальца, это произошло на фоне сообщений о том, что Роналду покинет клуб до закрытия трансферного окна[221], и игрок сказал Аллегри, что у него «нет намерения» оставаться игроком «Ювентуса»[222]. 26 августа в СМИ появилась информация, что агент Роналду Жорже Мендеш достиг устного соглашения с «Манчестер Сити» о личных условиях контракта[223], но на следующий день клуб отказался от сделки из-за общей стоимости трансфера[224]. В тот же день стало известно, что «Манчестер Юнайтед» вступил в переговоры о трансфере португальца[225][226], а бывший тренер Алекс Фергюсон и несколько бывших товарищей по команде поддерживали контакт, чтобы убедить его вернуться в «Юнайтед»[227][228].",
          'photo': '../assets/Cristiano.jpg'},
        {'id': 2, 'title': 'Cristiano Ronaldo', 'author': 'Kirill Zherdev', 'data': '05.11.21', 'text': "Вторая подряд победа в Серии А и новые рекорды (2019—2021)\n" +
              "23 сентября 2019 года Криштиану Роналду занял третье место в номинации на награду The Best FIFA Men’s Player[207]. 18 декабря португалец в борьбе за верховой мяч прыгнул на 256 см (выше перекладины футбольных ворот), в этом эпизоде он забил победный мяч в ворота «Сампдории»[208]. 6 января 2020 года Роналду сделал свой первый хет-трик в Серии А, благодаря чему «старая синьора» смогла одержать победу над «Кальяри» (4:0). 22 февраля в матче против СПАЛ Роналду забил гол в своей 11-й игре подряд в Серии А, повторив рекорд лиги, установленный Габриэлем Батистутой и Фабио Квальяреллой[209]. Также этот матч стал 1000-м для португальца в профессиональном футболе[209]. 17 июня 2020 года Криштиану Роналду сыграл в финале Кубка Италии против «Наполи», в котором «Ювентус» потерпел поражение по итогу серии пенальти[210]. 22 июня Роналду реализовал пенальти в матче против «Болоньи» и обогнал Руя Кошту, став самым результативным португальским игроком в истории чемпионата Италии[211]. 4 июля он забил свой 25-й гол в сезоне, реализовав штрафной удар в матче против «Торино». Роналду стал первым игроком «Ювентуса», достигшим данного результата после Омара Сивори, данный гол также стал первым для Криштиану со штрафного удара за 43 попытки в составе «бьянконери»[212]. 20 июля Роналду забил два гола в матче против «Лацио»; один из его мячей стал 50-м в Серии А. Криштиану Роналду забил 50 голов за 61 матч чемпионата Италии, из-за чего стал самым быстрым игроком, который достиг данного результата, а также первым игроком в истории, забившим 50 голов в чемпионатах Англии, Испании и Италии[213]. По итогам сезона Роналду вновь стал чемпионом Италии. Лигу чемпионов «Ювентус» покинул на стадии 1/4 финала, проиграв «Лиону» по правилу выездного гола. Роналду сделал дубль в ответном матче, но по сумме двух игр счёт был 2:2, что давало право пройти дальше французам[214].\n" +
              "\n" +
              "20 сентября 2020 года Роналду отличился забитым мячом уже в первом матче чемпионата против «Сампдории», чем помог своей команде победить со счётом 3:0[215]. В октябре португалец заразился инфекцией COVID-19, в связи с чем ему пришлось провести три недели в самоизоляции[216]. 1 ноября Роналду вновь появился на поле в матче против «Специи», он вышел со скамейки запасных во втором тайме и забил гол в течение первых трёх минут. Спустя некоторое время Роналду забил свой второй мяч с пенальти, чем помог своей команде одержать победу (4:1)[216]. 2 декабря Криштиану забил гол в ворота киевского «Динамо» в матче группового этапа Лиги чемпионов, который стал 750-м голом португальца в профессиональной карьере[217]. 13 декабря португалец сыграл свой 100-й матч в составе «Ювентуса» во всех соревнованиях, в этом матче он забил два гола, причём оба — с пенальти, чем помог своему клубу обыграть «Дженоа»[218]. Впоследствии Роналду занял второе место в номинации на награду The Best FIFA Men’s Player, уступив Роберту Левандовскому[219].\n" +
              "\n" +
              "22 августа 2021 года Роналду начал первую игру нового сезона на скамейке запасных, заменив испанца Альваро Морату в матче против «Удинезе» (2:2)[220]. Хотя тренер Массимилиано Аллегри подтвердил, что это было его решение из-за физической формы португальца, это произошло на фоне сообщений о том, что Роналду покинет клуб до закрытия трансферного окна[221], и игрок сказал Аллегри, что у него «нет намерения» оставаться игроком «Ювентуса»[222]. 26 августа в СМИ появилась информация, что агент Роналду Жорже Мендеш достиг устного соглашения с «Манчестер Сити» о личных условиях контракта[223], но на следующий день клуб отказался от сделки из-за общей стоимости трансфера[224]. В тот же день стало известно, что «Манчестер Юнайтед» вступил в переговоры о трансфере португальца[225][226], а бывший тренер Алекс Фергюсон и несколько бывших товарищей по команде поддерживали контакт, чтобы убедить его вернуться в «Юнайтед»[227][228].",
          'photo': '../assets/Cristiano.jpg'},
        {'id': 3, 'title': 'Cristiano Ronaldo', 'author': 'Dmitriy Krynickiy', 'data': '05.11.21', 'text': "Вторая подряд победа в Серии А и новые рекорды (2019—2021)\n" +
              "23 сентября 2019 года Криштиану Роналду занял третье место в номинации на награду The Best FIFA Men’s Player[207]. 18 декабря португалец в борьбе за верховой мяч прыгнул на 256 см (выше перекладины футбольных ворот), в этом эпизоде он забил победный мяч в ворота «Сампдории»[208]. 6 января 2020 года Роналду сделал свой первый хет-трик в Серии А, благодаря чему «старая синьора» смогла одержать победу над «Кальяри» (4:0). 22 февраля в матче против СПАЛ Роналду забил гол в своей 11-й игре подряд в Серии А, повторив рекорд лиги, установленный Габриэлем Батистутой и Фабио Квальяреллой[209]. Также этот матч стал 1000-м для португальца в профессиональном футболе[209]. 17 июня 2020 года Криштиану Роналду сыграл в финале Кубка Италии против «Наполи», в котором «Ювентус» потерпел поражение по итогу серии пенальти[210]. 22 июня Роналду реализовал пенальти в матче против «Болоньи» и обогнал Руя Кошту, став самым результативным португальским игроком в истории чемпионата Италии[211]. 4 июля он забил свой 25-й гол в сезоне, реализовав штрафной удар в матче против «Торино». Роналду стал первым игроком «Ювентуса», достигшим данного результата после Омара Сивори, данный гол также стал первым для Криштиану со штрафного удара за 43 попытки в составе «бьянконери»[212]. 20 июля Роналду забил два гола в матче против «Лацио»; один из его мячей стал 50-м в Серии А. Криштиану Роналду забил 50 голов за 61 матч чемпионата Италии, из-за чего стал самым быстрым игроком, который достиг данного результата, а также первым игроком в истории, забившим 50 голов в чемпионатах Англии, Испании и Италии[213]. По итогам сезона Роналду вновь стал чемпионом Италии. Лигу чемпионов «Ювентус» покинул на стадии 1/4 финала, проиграв «Лиону» по правилу выездного гола. Роналду сделал дубль в ответном матче, но по сумме двух игр счёт был 2:2, что давало право пройти дальше французам[214].\n" +
              "\n" +
              "20 сентября 2020 года Роналду отличился забитым мячом уже в первом матче чемпионата против «Сампдории», чем помог своей команде победить со счётом 3:0[215]. В октябре португалец заразился инфекцией COVID-19, в связи с чем ему пришлось провести три недели в самоизоляции[216]. 1 ноября Роналду вновь появился на поле в матче против «Специи», он вышел со скамейки запасных во втором тайме и забил гол в течение первых трёх минут. Спустя некоторое время Роналду забил свой второй мяч с пенальти, чем помог своей команде одержать победу (4:1)[216]. 2 декабря Криштиану забил гол в ворота киевского «Динамо» в матче группового этапа Лиги чемпионов, который стал 750-м голом португальца в профессиональной карьере[217]. 13 декабря португалец сыграл свой 100-й матч в составе «Ювентуса» во всех соревнованиях, в этом матче он забил два гола, причём оба — с пенальти, чем помог своему клубу обыграть «Дженоа»[218]. Впоследствии Роналду занял второе место в номинации на награду The Best FIFA Men’s Player, уступив Роберту Левандовскому[219].\n" +
              "\n" +
              "22 августа 2021 года Роналду начал первую игру нового сезона на скамейке запасных, заменив испанца Альваро Морату в матче против «Удинезе» (2:2)[220]. Хотя тренер Массимилиано Аллегри подтвердил, что это было его решение из-за физической формы португальца, это произошло на фоне сообщений о том, что Роналду покинет клуб до закрытия трансферного окна[221], и игрок сказал Аллегри, что у него «нет намерения» оставаться игроком «Ювентуса»[222]. 26 августа в СМИ появилась информация, что агент Роналду Жорже Мендеш достиг устного соглашения с «Манчестер Сити» о личных условиях контракта[223], но на следующий день клуб отказался от сделки из-за общей стоимости трансфера[224]. В тот же день стало известно, что «Манчестер Юнайтед» вступил в переговоры о трансфере португальца[225][226], а бывший тренер Алекс Фергюсон и несколько бывших товарищей по команде поддерживали контакт, чтобы убедить его вернуться в «Юнайтед»[227][228].",
          'photo': '../assets/Cristiano.jpg'},
        {'id': 4, 'title': 'Cristiano Ronaldo', 'author': 'Daniil Grygorievskiy', 'data': '05.11.21', 'text': "Вторая подряд победа в Серии А и новые рекорды (2019—2021)\n" +
              "23 сентября 2019 года Криштиану Роналду занял третье место в номинации на награду The Best FIFA Men’s Player[207]. 18 декабря португалец в борьбе за верховой мяч прыгнул на 256 см (выше перекладины футбольных ворот), в этом эпизоде он забил победный мяч в ворота «Сампдории»[208]. 6 января 2020 года Роналду сделал свой первый хет-трик в Серии А, благодаря чему «старая синьора» смогла одержать победу над «Кальяри» (4:0). 22 февраля в матче против СПАЛ Роналду забил гол в своей 11-й игре подряд в Серии А, повторив рекорд лиги, установленный Габриэлем Батистутой и Фабио Квальяреллой[209]. Также этот матч стал 1000-м для португальца в профессиональном футболе[209]. 17 июня 2020 года Криштиану Роналду сыграл в финале Кубка Италии против «Наполи», в котором «Ювентус» потерпел поражение по итогу серии пенальти[210]. 22 июня Роналду реализовал пенальти в матче против «Болоньи» и обогнал Руя Кошту, став самым результативным португальским игроком в истории чемпионата Италии[211]. 4 июля он забил свой 25-й гол в сезоне, реализовав штрафной удар в матче против «Торино». Роналду стал первым игроком «Ювентуса», достигшим данного результата после Омара Сивори, данный гол также стал первым для Криштиану со штрафного удара за 43 попытки в составе «бьянконери»[212]. 20 июля Роналду забил два гола в матче против «Лацио»; один из его мячей стал 50-м в Серии А. Криштиану Роналду забил 50 голов за 61 матч чемпионата Италии, из-за чего стал самым быстрым игроком, который достиг данного результата, а также первым игроком в истории, забившим 50 голов в чемпионатах Англии, Испании и Италии[213]. По итогам сезона Роналду вновь стал чемпионом Италии. Лигу чемпионов «Ювентус» покинул на стадии 1/4 финала, проиграв «Лиону» по правилу выездного гола. Роналду сделал дубль в ответном матче, но по сумме двух игр счёт был 2:2, что давало право пройти дальше французам[214].\n" +
              "\n" +
              "20 сентября 2020 года Роналду отличился забитым мячом уже в первом матче чемпионата против «Сампдории», чем помог своей команде победить со счётом 3:0[215]. В октябре португалец заразился инфекцией COVID-19, в связи с чем ему пришлось провести три недели в самоизоляции[216]. 1 ноября Роналду вновь появился на поле в матче против «Специи», он вышел со скамейки запасных во втором тайме и забил гол в течение первых трёх минут. Спустя некоторое время Роналду забил свой второй мяч с пенальти, чем помог своей команде одержать победу (4:1)[216]. 2 декабря Криштиану забил гол в ворота киевского «Динамо» в матче группового этапа Лиги чемпионов, который стал 750-м голом португальца в профессиональной карьере[217]. 13 декабря португалец сыграл свой 100-й матч в составе «Ювентуса» во всех соревнованиях, в этом матче он забил два гола, причём оба — с пенальти, чем помог своему клубу обыграть «Дженоа»[218]. Впоследствии Роналду занял второе место в номинации на награду The Best FIFA Men’s Player, уступив Роберту Левандовскому[219].\n" +
              "\n" +
              "22 августа 2021 года Роналду начал первую игру нового сезона на скамейке запасных, заменив испанца Альваро Морату в матче против «Удинезе» (2:2)[220]. Хотя тренер Массимилиано Аллегри подтвердил, что это было его решение из-за физической формы португальца, это произошло на фоне сообщений о том, что Роналду покинет клуб до закрытия трансферного окна[221], и игрок сказал Аллегри, что у него «нет намерения» оставаться игроком «Ювентуса»[222]. 26 августа в СМИ появилась информация, что агент Роналду Жорже Мендеш достиг устного соглашения с «Манчестер Сити» о личных условиях контракта[223], но на следующий день клуб отказался от сделки из-за общей стоимости трансфера[224]. В тот же день стало известно, что «Манчестер Юнайтед» вступил в переговоры о трансфере португальца[225][226], а бывший тренер Алекс Фергюсон и несколько бывших товарищей по команде поддерживали контакт, чтобы убедить его вернуться в «Юнайтед»[227][228].",
          'photo': '../assets/Cristiano.jpg'}
      ],
      like: false,
      dislike: false,
      like_count: 0,
      dislike_count: 0,
    }
  },
  components:{
    NewsApp,
  },
  methods:{
    like_func(){
      if (this.like === this.dislike){
        this.like = !this.like
        this.like_count += 1
      }
      else{
        if (this.like === true){
          this.like = false
          this.like_count -= 1
        }
        else{
          this.like = !this.like
          this.like_count += 1
          this.dislike = !this.dislike
          this.dislike_count -= 1
        }
      }
    },
    dislike_func(){
      if (this.like === this.dislike){
        this.dislike = !this.dislike
        this.dislike_count += 1
      }
      else{
        if (this.dislike === true){
          this.dislike = false
          this.dislike_count -= 1
        }
        else{
          this.like = !this.like
          this.like_count -= 1
          this.dislike = !this.dislike
          this.dislike_count += 1
        }
      }
    }
  },
}
</script>

<style scoped>
  .container-md{
    box-shadow: 0 0 5px 1px grey;
    margin-bottom: 100px;
  }
  ul{
    list-style: none;
  }
  .wrapper-sm{
    padding: 2%;
  }
</style>